testCases/counterflowDiffusion_FGM/constant/fgmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| FGM (FPV + beta-PDF) lookup table generated by 04_build_fgm_table.py        |
| source flamelets: flamelets_synth.npz                                    |
| P = 1e+07 Pa,  PV species: CO2,CO,H2O,H2               |
| axes: Z~ (nZ=51), gZ=Zvar/(Z~(1-Z~)) (nG=11), C~ (nC=41)              |
| sourcePV ordering (C-order): idx = (iZ*nG + iG)*nC + iC                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fgmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nZ      51;
nGz     11;
nC      41;

Z
(
    0.00000000e+00
    2.00000000e-02
    4.00000000e-02
    6.00000000e-02
    8.00000000e-02
    1.00000000e-01
    1.20000000e-01
    1.40000000e-01
    1.60000000e-01
    1.80000000e-01
    2.00000000e-01
    2.20000000e-01
    2.40000000e-01
    2.60000000e-01
    2.80000000e-01
    3.00000000e-01
    3.20000000e-01
    3.40000000e-01
    3.60000000e-01
    3.80000000e-01
    4.00000000e-01
    4.20000000e-01
    4.40000000e-01
    4.60000000e-01
    4.80000000e-01
    5.00000000e-01
    5.20000000e-01
    5.40000000e-01
    5.60000000e-01
    5.80000000e-01
    6.00000000e-01
    6.20000000e-01
    6.40000000e-01
    6.60000000e-01
    6.80000000e-01
    7.00000000e-01
    7.20000000e-01
    7.40000000e-01
    7.60000000e-01
    7.80000000e-01
    8.00000000e-01
    8.20000000e-01
    8.40000000e-01
    8.60000000e-01
    8.80000000e-01
    9.00000000e-01
    9.20000000e-01
    9.40000000e-01
    9.60000000e-01
    9.80000000e-01
    1.00000000e+00
);

gZ
(
    0.00000000e+00
    9.00000000e-02
    1.80000000e-01
    2.70000000e-01
    3.60000000e-01
    4.50000000e-01
    5.40000000e-01
    6.30000000e-01
    7.20000000e-01
    8.10000000e-01
    9.00000000e-01
);

C
(
    0.00000000e+00
    7.49934076e-03
    1.49986815e-02
    2.24980223e-02
    2.99973630e-02
    3.74967038e-02
    4.49960446e-02
    5.24953853e-02
    5.99947261e-02
    6.74940669e-02
    7.49934076e-02
    8.24927484e-02
    8.99920891e-02
    9.74914299e-02
    1.04990771e-01
    1.12490111e-01
    1.19989452e-01
    1.27488793e-01
    1.34988134e-01
    1.42487474e-01
    1.49986815e-01
    1.57486156e-01
    1.64985497e-01
    1.72484838e-01
    1.79984178e-01
    1.87483519e-01
    1.94982860e-01
    2.02482201e-01
    2.09981541e-01
    2.17480882e-01
    2.24980223e-01
    2.32479564e-01
    2.39978904e-01
    2.47478245e-01
    2.54977586e-01
    2.62476927e-01
    2.69976267e-01
    2.77475608e-01
    2.84974949e-01
    2.92474290e-01
    2.99973630e-01
);

sourcePV
(
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
    0.00000000e+00
...
);

// ************************************************************************* //
