testCases/counterflowDiffusion_FGM/0.orig/U
FoamFile { format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (1 0 0);
boundaryField
{
    inlet { type fixedValue; value uniform (1 0 0); }
    outlet { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    upperWall { type symmetry; }
    lowerWall { type symmetry; }
    frontAndBack { type empty; }
}
